package ci.ashamaz.hwheroku.enums;

import lombok.AllArgsConstructor;
import lombok.Getter;

import java.io.Serializable;

@AllArgsConstructor
@Getter
public enum TarotEnum implements Serializable {
    SA_0("Дурак", 0, 0, "Аркан", "0СА", "Воздух", "Аркан", 1), SA_1("Маг", 1, 1, "Аркан", "1СА", "Воздух", "Аркан", 1),
    SA_2("Жрица", 2, 2, "Аркан", "2СА", "Вода", "Аркан", -1), SA_3("Императрица", 3, 3, "Аркан", "3СА", "Земля", "Аркан", 1),
    SA_4("Император", 4, 4, "Аркан", "4СА", "Огонь", "Аркан", -1), SA_5("Иерофант", 5, 5, "Аркан", "5СА", "Земля", "Аркан", -1),
    SA_6("Влюбленные", 6, 6, "Аркан", "6СА", "Воздух", "Аркан", 1), SA_7("Колесница", 7, 7, "Аркан", "7СА", "Вода", "Аркан", 2),
    SA_8("Сила", 8, 8, "Аркан", "9СА", "Огонь", "Аркан", 1), SA_9("Отшельник", 9, 9, "Аркан", "9СА", "Земля", "Аркан", -1),
    SA_10("Колесо фортуны", 10, 1, "Аркан", "10СА", "Огонь", "Аркан", 2), SA_11("Справедливость", 11, 2, "Аркан", "11СА", "Воздух", "Аркан", 1),
    SA_12("Повешенный", 12, 3, "Аркан", "12СА", "Вода", "Аркан", -1), SA_13("Смерть", 13, 4, "Аркан", "13СА", "Вода", "Аркан", -1),
    SA_14("Умеренность", 14, 5, "Аркан", "14СА", "Огонь", "Аркан", -1), SA_15("Дьявол", 15, 6, "Аркан", "15СА", "Земля", "Аркан", -1),
    SA_16("Башня", 16, 7, "Аркан", "16СА", "Огонь", "Аркан", 2), SA_17("Звезда", 17, 8, "Аркан", "17СА", "Воздух", "Аркан", 1),
    SA_18("Луна", 18, 9, "Аркан", "18СА", "Вода", "Аркан", -1), SA_19("Солнце", 19, 1, "Аркан", "19СА", "Огонь", "Аркан", 1),
    SA_20("Суд", 20, 2, "Аркан", "20СА", "Вода", "Аркан", 0), SA_21("Мир", 21, 3, "Аркан", "21СА", "Земля", "Аркан", 1),

    W_1("Туз жезлов", 1, 1, "Жезлы", "1Ж", "Огонь", "Ч", 2), W_2("Двойка жезлов", 2, 2, "Жезлы", "2Ж", "Огонь", "Ч", 1),
    W_3("Тройка жезлов", 3, 3, "Жезлы", "3Ж", "Огонь", "Ч", 2), W_4("Четверка жезлов", 4, 4, "Жезлы", "4Ж", "Огонь", "Ч", 0),
    W_5("Пятерка жезлов", 5, 5, "Жезлы", "5Ж", "Огонь", "Ч", 2), W_6("Шестерка жезлов", 6, 6, "Жезлы", "6Ж", "Огонь", "Ч", 1),
    W_7("Семерка жезлов", 7, 7, "Жезлы", "7Ж", "Огонь", "Ч", 2), W_8("Восьмерка жезлов", 8, 8, "Жезлы", "8Ж", "Огонь", "Ч", 1),
    W_9("Девятка жезлов", 9, 9, "Жезлы", "9Ж", "Огонь", "Ч", 2), W_10("Десятка жезлов", 10, 1, "Жезлы", "10Ж", "Огонь", "Ч", 1),
    W_PAGE("Паж жезлов", 11, 2, "Жезлы", "пЖ", "Огонь", "Ф", 1),
    W_KNIGHT("Рыцарь жезлов", 12, 3, "Жезлы", "рЖ", "Огонь", "Ф", 2),
    W_QUEEN("Дама жезлов", 13, 4, "Жезлы", "дЖ", "Огонь", "Ф", 0), W_KING("Король жезлов", 14, 5, "Жезлы", "кЖ", "Огонь", "Ф", 1),

    S_1("Туз мечей", 1, 1, "Мечи", "1М", "Воздух", "Ч", 2), S_2("Двойка мечей", 2, 2, "Мечи", "2М", "Воздух", "Ч", 1),
    S_3("Тройка мечей", 3, 3, "Мечи", "3М", "Воздух", "Ч", 2), S_4("Четверка мечей", 4, 4, "Мечи", "4М", "Воздух", "Ч", 0),
    S_5("Пятерка мечей", 5, 5, "Мечи", "5М", "Воздух", "Ч", 2), S_6("Шестерка мечей", 6, 6, "Мечи", "6М", "Воздух", "Ч", 1),
    S_7("Семерка мечей", 7, 7, "Мечи", "7М", "Воздух", "Ч", 2), S_8("Восьмерка мечей", 8, 8, "Мечи", "8М", "Воздух", "Ч", 1),
    S_9("Девятка мечей", 9, 9, "Мечи", "9М", "Воздух", "Ч", 2), S_10("Десятка мечей", 10, 1, "Мечи", "10М", "Воздух", "Ч", 1),
    S_PAGE("Паж мечей", 11, 2, "Мечи", "пМ", "Воздух", "Ф", 1), S_KNIGHT("Рыцарь мечей", 12, 3, "Мечи", "рМ", "Воздух", "Ф", 2),
    S_QUEEN("Дама мечей", 13, 4, "Мечи", "дМ", "Воздух", "Ф", 0), S_KING("Король мечей", 14, 5, "Мечи", "кМ", "Воздух", "Ф", 1),

    P_1("Туз пентаклей", 1, 1, "Пентакли", "1П", "Земля", "Ч", 0), P_2("Двойка пентаклей", 2, 2, "Пентакли", "2П", "Земля", "Ч", -1),
    P_3("Тройка пентаклей", 3, 3, "Пентакли", "3П", "Земля", "Ч", 0), P_4("Четверка пентаклей", 4, 4, "Пентакли", "4П", "Земля", "Ч", -2),
    P_5("Пятерка пентаклей", 5, 5, "Пентакли", "5П", "Земля", "Ч", 0), P_6("Шестерка пентаклей", 6, 6, "Пентакли", "6П", "Земля", "Ч", -1),
    P_7("Семерка пентаклей", 7, 7, "Пентакли", "7П", "Земля", "Ч", 0),
    P_8("Восьмерка пентаклей", 8, 8, "Пентакли", "8П", "Земля", "Ч", -1),
    P_9("Девятка пентаклей", 9, 9, "Пентакли", "9П", "Земля", "Ч", 0), P_10("Десятка пентаклей", 10, 1, "Пентакли", "10П", "Земля", "Ч", -1),
    P_PAGE("Паж пентаклей", 11, 2, "Пентакли", "пП", "Земля", "Ф", -1), P_KNIGHT("Рыцарь пентаклей", 12, 3, "Пентакли", "рП", "Земля", "Ф", 0),
    P_QUEEN("Дама пентаклей", 13, 4, "Пентакли", "дП", "Земля", "Ф", -2), P_KING("Король пентаклей", 14, 5, "Пентакли", "кП", "Земля", "Ф", -1),

    C_1("Туз кубков", 1, 1, "Чаши", "1К", "Вода", "Ч", 1), C_2("Двойка кубков", 2, 2, "Чаши", "2К", "Вода", "Ч", 0),
    C_3("Тройка кубков", 3, 3, "Чаши", "3К", "Вода", "Ч", 1), C_4("Четверка кубков", 4, 4, "Чаши", "4К", "Вода", "Ч", -1),
    C_5("Пятерка кубков", 5, 5, "Чаши", "5К", "Вода", "Ч", 1), C_6("Шестерка кубков", 6, 6, "Чаши", "6К", "Вода", "Ч", 0),
    C_7("Семерка кубков", 7, 7, "Чаши", "7К", "Вода", "Ч", 1), C_8("Восьмерка кубков", 8, 8, "Чаши", "8К", "Вода", "Ч", 0),
    C_9("Девятка кубков", 9, 9, "Чаши", "9К", "Вода", "Ч", 1), C_10("Десятка кубков", 10, 10, "Чаши", "10К", "Вода", "Ч", 0),
    C_PAGE("Паж кубков", 11, 11, "Чаши", "пК", "Вода", "Ф", 0), C_KNIGHT("Рыцарь кубков", 12, 12, "Чаши", "рК", "Вода", "Ф", 1),
    C_QUEEN("Дама кубков", 13, 13, "Чаши", "дК", "Вода", "Ф", -1), C_KING("Король кубков", 14, 14, "Чаши", "кК", "Вода", "Ф", 0);

    private String displayName;
    private int number;
    private int summedNum;
    private String suit;
    private String shortTitle;
    private String element;
    private String weight; //фигура
    private int activeness;

    @Override
    public String toString() {
        return name();
    }
}
