package ci.ashamaz.hwheroku.enums;

import lombok.Getter;

@Getter
public enum TarotCards {
    SA_0        ("Дурак", 0, 0, "Аркан", "0СА", "Воздух", "Аркан"),
    SA_1        ("Маг", 1, 1, "Аркан", "1СА", "Воздух", "Аркан"),
    SA_2        ("Жрица", 2, 2, "Аркан", "2СА", "Вода", "Аркан"),
    SA_3        ("Императрица", 3, 3, "Аркан", "3СА", "Земля", "Аркан"),
    SA_4        ("Император", 4, 4, "Аркан", "4СА", "Огонь", "Аркан"),
    SA_5        ("Иерофант", 5, 5, "Аркан", "5СА", "Земля", "Аркан"),
    SA_6        ("Влюбленные", 6, 6, "Аркан", "6СА", "Воздух", "Аркан"),
    SA_7        ("Колесница", 7, 7, "Аркан", "7СА", "Вода", "Аркан"),
    SA_8        ("Сила", 8, 8, "Аркан", "9СА", "Огонь", "Аркан"),
    SA_9        ("Отшельник", 9, 9, "Аркан", "9СА", "Земля", "Аркан"),
    SA_10       ("Колесо фортуны", 10, 1, "Аркан", "10СА", "Огонь", "Аркан"),
    SA_11       ("Справедливость", 11, 2, "Аркан", "11СА", "Воздух", "Аркан"),
    SA_12       ("Повешенный", 12, 3, "Аркан", "12СА", "Вода", "Аркан"),
    SA_13       ("Смерть", 13, 4, "Аркан", "13СА", "Вода", "Аркан"),
    SA_14       ("Умеренность", 14, 5, "Аркан", "14СА", "Огонь", "Аркан"),
    SA_15       ("Дьявол", 15, 6, "Аркан", "15СА", "Земля", "Аркан"),
    SA_16       ("Башня", 16, 7, "Аркан", "16СА", "Огонь", "Аркан"),
    SA_17       ("Звезда", 17, 8, "Аркан", "17СА", "Воздух", "Аркан"),
    SA_18       ("Луна", 18, 9, "Аркан", "18СА", "Вода", "Аркан"),
    SA_19       ("Солнце", 19, 1, "Аркан", "19СА", "Огонь", "Аркан"),
    SA_20       ("Суд", 20, 2, "Аркан", "20СА", "Вода", "Аркан"),
    SA_21       ("Мир", 21, 3, "Аркан", "21СА", "Земля", "Аркан"),

    W_1         ("Туз жезлов", 1, 1, "Жезлы", "1Ж", "Огонь", "ЧЖ"),
    W_2         ("Двойка жезлов", 2, 2, "Жезлы", "2Ж", "Огонь", "ЧЖ"),
    W_3         ("Тройка жезлов", 3, 3, "Жезлы", "3Ж", "Огонь", "ЧЖ"),
    W_4         ("Четверка жезлов", 4, 4, "Жезлы", "4Ж", "Огонь", "ЧЖ"),
    W_5         ("Пятерка жезлов", 5, 5, "Жезлы", "5Ж", "Огонь", "ЧЖ"),
    W_6         ("Шестерка жезлов", 6, 6, "Жезлы", "6Ж", "Огонь", "ЧЖ"),
    W_7         ("Семерка жезлов", 7, 7, "Жезлы", "7Ж", "Огонь", "ЧЖ"),
    W_8         ("Восьмерка жезлов", 8, 8, "Жезлы", "8Ж", "Огонь", "ЧЖ"),
    W_9         ("Девятка жезлов", 9, 9, "Жезлы", "9Ж", "Огонь", "ЧЖ"),
    W_10        ("Десятка жезлов", 10, 1, "Жезлы", "10Ж", "Огонь", "ЧЖ"),
    W_PAGE      ("Паж жезлов", 11, 2, "Жезлы", "пЖ", "Огонь", "ФЖ"),
    W_KNIGHT    ("Рыцарь жезлов", 12, 3, "Жезлы", "рЖ", "Огонь", "ФЖ"),
    W_QUEEN     ("Дама жезлов", 13, 4, "Жезлы", "дЖ", "Огонь", "ФЖ"),
    W_KING      ("Король жезлов", 14, 5, "Жезлы", "кЖ", "Огонь", "ФЖ"),

    S_1         ("Туз мечей", 1, 1, "Мечи", "1М", "Воздух", "ЧМ"),
    S_2         ("Двойка мечей", 2, 2, "Мечи", "2М", "Воздух", "ЧМ"),
    S_3         ("Тройка мечей", 3, 3, "Мечи", "3М", "Воздух", "ЧМ"),
    S_4         ("Четверка мечей", 4, 4, "Мечи", "4М", "Воздух", "ЧМ"),
    S_5         ("Пятерка мечей", 5, 5, "Мечи", "5М", "Воздух", "ЧМ"),
    S_6         ("Шестерка мечей", 6, 6, "Мечи", "6М", "Воздух", "ЧМ"),
    S_7         ("Семерка мечей", 7, 7, "Мечи", "7М", "Воздух", "ЧМ"),
    S_8         ("Восьмерка мечей", 8, 8, "Мечи", "8М", "Воздух", "ЧМ"),
    S_9         ("Девятка мечей", 9, 9, "Мечи", "9М", "Воздух", "ЧМ"),
    S_10        ("Десятка мечей", 10, 1, "Мечи", "10М", "Воздух", "ЧМ"),
    S_PAGE      ("Паж мечей", 11, 2, "Мечи", "пМ", "Воздух", "ФМ"),
    S_KNIGHT    ("Рыцарь мечей", 12, 3, "Мечи", "рМ", "Воздух", "ФМ"),
    S_QUEEN     ("Дама мечей", 13, 4, "Мечи", "дМ", "Воздух", "ФМ"),
    S_KING      ("Король мечей", 14, 5, "Мечи", "кМ", "Воздух", "ФМ"),

    P_1         ("Туз пентаклей", 1, 1, "Пентакли", "1П", "Земля", "ЧП"),
    P_2         ("Двойка пентаклей", 2, 2, "Пентакли", "2П", "Земля", "ЧП"),
    P_3         ("Тройка пентаклей", 3, 3, "Пентакли", "3П", "Земля", "ЧП"),
    P_4         ("Четверка пентаклей", 4, 4, "Пентакли", "4П", "Земля", "ЧП"),
    P_5         ("Пятерка пентаклей", 5, 5, "Пентакли", "5П", "Земля", "ЧП"),
    P_6         ("Шестерка пентаклей", 6, 6, "Пентакли", "6П", "Земля", "ЧП"),
    P_7         ("Семерка пентаклей", 7, 7, "Пентакли", "7П", "Земля", "ЧП"),
    P_8         ("Восьмерка пентаклей", 8, 8, "Пентакли", "8П", "Земля", "ЧП"),
    P_9         ("Девятка пентаклей", 9, 9, "Пентакли", "9П", "Земля", "ЧП"),
    P_10        ("Десятка пентаклей", 10, 1, "Пентакли", "10П", "Земля", "ЧП"),
    P_PAGE      ("Паж пентаклей", 11, 2, "Пентакли", "пП", "Земля", "ФП"),
    P_KNIGHT    ("Рыцарь пентаклей", 12, 3, "Пентакли", "рП", "Земля", "ФП"),
    P_QUEEN     ("Дама пентаклей", 13, 4, "Пентакли", "дП", "Земля", "ФП"),
    P_KING      ("Король пентаклей", 14, 5, "Пентакли", "кП", "Земля", "ФП"),

    C_1         ("Туз кубков", 1, 1, "Чаши", "1К", "Вода", "ЧК"),
    C_2         ("Двойка кубков", 2, 2, "Чаши", "2К", "Вода", "ЧК"),
    C_3         ("Тройка кубков", 3, 3, "Чаши", "3К", "Вода", "ЧК"),
    C_4         ("Четверка кубков", 4, 4, "Чаши", "4К", "Вода", "ЧК"),
    C_5         ("Пятерка кубков", 5, 5, "Чаши", "5К", "Вода", "ЧК"),
    C_6         ("Шестерка кубков", 6, 6, "Чаши", "6К", "Вода", "ЧК"),
    C_7         ("Семерка кубков", 7, 7, "Чаши", "7К", "Вода", "ЧК"),
    C_8         ("Восьмерка кубков", 8, 8, "Чаши", "8К", "Вода", "ЧК"),
    C_9         ("Девятка кубков", 9, 9, "Чаши", "9К", "Вода", "ЧК"),
    C_10        ("Десятка кубков", 10, 10, "Чаши", "10К", "Вода", "ЧК"),
    C_PAGE      ("Паж кубков", 11, 11, "Чаши", "пК", "Вода", "ФК"),
    C_KNIGHT    ("Рыцарь кубков", 12, 12, "Чаши", "рК", "Вода", "ФК"),
    C_QUEEN     ("Дама кубков", 13, 13, "Чаши", "дК", "Вода", "ФК"),
    C_KING      ("Король кубков", 14, 14, "Чаши", "кК", "Вода", "ФК");

    private String displayName;
    private int number;
    private int summedNum;
    private String suit;
    private String shortTitle;
    private String element;
    private String weight; //фигура

    TarotCards(String displayName, int number, int summedNum, String suit, String shortTitle, String element,  String weight) {
        this.displayName = displayName;
        this.number = number;
        this.summedNum = summedNum;
        this.suit = suit;
        this.shortTitle = shortTitle;
        this.element = element;
        this.weight = weight;
    }

    @Override
    public String toString() {
        return "";
    }
}
