package ci.ashamaz.hwheroku.enums;

import lombok.AllArgsConstructor;
import lombok.Getter;

import java.io.Serializable;

@AllArgsConstructor
@Getter
public enum TarotEnum implements Serializable {
    SA_0("Дурак", 0, 0, "Аркан", "0СА", "Воздух", "Аркан", "00.gif"),
    SA_1("Маг", 1, 1, "Аркан", "1СА", "Воздух", "Аркан", "01.gif"),
    SA_2("Жрица", 2, 2, "Аркан", "2СА", "Вода", "Аркан", "02.gif"),
    SA_3("Императрица", 3, 3, "Аркан", "3СА", "Земля", "Аркан", "03.gif"),
    SA_4("Император", 4, 4, "Аркан", "4СА", "Огонь", "Аркан", "04.gif"),
    SA_5("Иерофант", 5, 5, "Аркан", "5СА", "Земля", "Аркан", "05.gif"),
    SA_6("Влюбленные", 6, 6, "Аркан", "6СА", "Воздух", "Аркан", "06.gif"),
    SA_7("Колесница", 7, 7, "Аркан", "7СА", "Вода", "Аркан", "07.gif"),
    SA_8("Сила", 8, 8, "Аркан", "9СА", "Огонь", "Аркан", "08.gif"),
    SA_9("Отшельник", 9, 9, "Аркан", "9СА", "Земля", "Аркан", "09.gif"),
    SA_10("Колесо фортуны", 10, 1, "Аркан", "10СА", "Огонь", "Аркан", "10.gif"),
    SA_11("Справедливость", 11, 2, "Аркан", "11СА", "Воздух", "Аркан", "11.gif"),
    SA_12("Повешенный", 12, 3, "Аркан", "12СА", "Вода", "Аркан", "12.gif"),
    SA_13("Смерть", 13, 4, "Аркан", "13СА", "Вода", "Аркан", "13.gif"),
    SA_14("Умеренность", 14, 5, "Аркан", "14СА", "Огонь", "Аркан", "14.gif"),
    SA_15("Дьявол", 15, 6, "Аркан", "15СА", "Земля", "Аркан", "15.gif"),
    SA_16("Башня", 16, 7, "Аркан", "16СА", "Огонь", "Аркан", "16.gif"),
    SA_17("Звезда", 17, 8, "Аркан", "17СА", "Воздух", "Аркан", "17.gif"),
    SA_18("Луна", 18, 9, "Аркан", "18СА", "Вода", "Аркан", "18.gif"),
    SA_19("Солнце", 19, 1, "Аркан", "19СА", "Огонь", "Аркан", "19.gif"),
    SA_20("Суд", 20, 2, "Аркан", "20СА", "Вода", "Аркан", "20.gif"),
    SA_21("Мир", 21, 3, "Аркан", "21СА", "Земля", "Аркан", "21.gif"),

    W_1("Туз жезлов", 1, 1, "Жезлы", "1Ж", "Огонь", "Ч", "26.gif"),
    W_2("Двойка жезлов", 2, 2, "Жезлы", "2Ж", "Огонь", "Ч", "27.gif"),
    W_3("Тройка жезлов", 3, 3, "Жезлы", "3Ж", "Огонь", "Ч", "28.gif"),
    W_4("Четверка жезлов", 4, 4, "Жезлы", "4Ж", "Огонь", "Ч", "29.gif"),
    W_5("Пятерка жезлов", 5, 5, "Жезлы", "5Ж", "Огонь", "Ч", "30.gif"),
    W_6("Шестерка жезлов", 6, 6, "Жезлы", "6Ж", "Огонь", "Ч", "31.gif"),
    W_7("Семерка жезлов", 7, 7, "Жезлы", "7Ж", "Огонь", "Ч", "32.gif"),
    W_8("Восьмерка жезлов", 8, 8, "Жезлы", "8Ж", "Огонь", "Ч", "33.gif"),
    W_9("Девятка жезлов", 9, 9, "Жезлы", "9Ж", "Огонь", "Ч", "34.gif"),
    W_10("Десятка жезлов", 10, 1, "Жезлы", "10Ж", "Огонь", "Ч", "35.gif"),
    W_PAGE("Паж жезлов", 11, 2, "Жезлы", "пЖ", "Огонь", "Ф", "25.gif"),
    W_KNIGHT("Рыцарь жезлов", 12, 3, "Жезлы", "рЖ", "Огонь", "Ф", "24.gif"),
    W_QUEEN("Дама жезлов", 13, 4, "Жезлы", "дЖ", "Огонь", "Ф", "23.gif"),
    W_KING("Король жезлов", 14, 5, "Жезлы", "кЖ", "Огонь", "Ф", "22.gif"),

    S_1("Туз мечей", 1, 1, "Мечи", "1М", "Воздух", "Ч", "68.gif"),
    S_2("Двойка мечей", 2, 2, "Мечи", "2М", "Воздух", "Ч", "69.gif"),
    S_3("Тройка мечей", 3, 3, "Мечи", "3М", "Воздух", "Ч", "70.gif"),
    S_4("Четверка мечей", 4, 4, "Мечи", "4М", "Воздух", "Ч", "71.gif"),
    S_5("Пятерка мечей", 5, 5, "Мечи", "5М", "Воздух", "Ч", "72.gif"),
    S_6("Шестерка мечей", 6, 6, "Мечи", "6М", "Воздух", "Ч", "73.gif"),
    S_7("Семерка мечей", 7, 7, "Мечи", "7М", "Воздух", "Ч", "74.gif"),
    S_8("Восьмерка мечей", 8, 8, "Мечи", "8М", "Воздух", "Ч", "75.gif"),
    S_9("Девятка мечей", 9, 9, "Мечи", "9М", "Воздух", "Ч", "76.gif"),
    S_10("Десятка мечей", 10, 1, "Мечи", "10М", "Воздух", "Ч", "77.gif"),
    S_PAGE("Паж мечей", 11, 2, "Мечи", "пМ", "Воздух", "Ф", "67.gif"),
    S_KNIGHT("Рыцарь мечей", 12, 3, "Мечи", "рМ", "Воздух", "Ф", "66.gif"),
    S_QUEEN("Дама мечей", 13, 4, "Мечи", "дМ", "Воздух", "Ф", "65.gif"),
    S_KING("Король мечей", 14, 5, "Мечи", "кМ", "Воздух", "Ф", "64.gif"),

    P_1("Туз пентаклей", 1, 1, "Пентакли", "1П", "Земля", "Ч", "54.gif"),
    P_2("Двойка пентаклей", 2, 2, "Пентакли", "2П", "Земля", "Ч", "55.gif"),
    P_3("Тройка пентаклей", 3, 3, "Пентакли", "3П", "Земля", "Ч", "56.gif"),
    P_4("Четверка пентаклей", 4, 4, "Пентакли", "4П", "Земля", "Ч", "57.gif"),
    P_5("Пятерка пентаклей", 5, 5, "Пентакли", "5П", "Земля", "Ч", "58.gif"),
    P_6("Шестерка пентаклей", 6, 6, "Пентакли", "6П", "Земля", "Ч", "59.gif"),
    P_7("Семерка пентаклей", 7, 7, "Пентакли", "7П", "Земля", "Ч", "60.gif"),
    P_8("Восьмерка пентаклей", 8, 8, "Пентакли", "8П", "Земля", "Ч", "61.gif"),
    P_9("Девятка пентаклей", 9, 9, "Пентакли", "9П", "Земля", "Ч", "62.gif"),
    P_10("Десятка пентаклей", 10, 1, "Пентакли", "10П", "Земля", "Ч", "63.gif"),
    P_PAGE("Паж пентаклей", 11, 2, "Пентакли", "пП", "Земля", "Ф", "53.gif"),
    P_KNIGHT("Рыцарь пентаклей", 12, 3, "Пентакли", "рП", "Земля", "Ф", "52.gif"),
    P_QUEEN("Дама пентаклей", 13, 4, "Пентакли", "дП", "Земля", "Ф", "51.gif"),
    P_KING("Король пентаклей", 14, 5, "Пентакли", "кП", "Земля", "Ф", "50.gif"),

    C_1("Туз кубков", 1, 1, "Чаши", "1К", "Вода", "Ч", "40.gif"),
    C_2("Двойка кубков", 2, 2, "Чаши", "2К", "Вода", "Ч", "41.gif"),
    C_3("Тройка кубков", 3, 3, "Чаши", "3К", "Вода", "Ч", "42.gif"),
    C_4("Четверка кубков", 4, 4, "Чаши", "4К", "Вода", "Ч", "43.gif"),
    C_5("Пятерка кубков", 5, 5, "Чаши", "5К", "Вода", "Ч", "44.gif"),
    C_6("Шестерка кубков", 6, 6, "Чаши", "6К", "Вода", "Ч", "45.gif"),
    C_7("Семерка кубков", 7, 7, "Чаши", "7К", "Вода", "Ч", "46.gif"),
    C_8("Восьмерка кубков", 8, 8, "Чаши", "8К", "Вода", "Ч", "47.gif"),
    C_9("Девятка кубков", 9, 9, "Чаши", "9К", "Вода", "Ч", "48.gif"),
    C_10("Десятка кубков", 10, 10, "Чаши", "10К", "Вода", "Ч", "49.gif"),
    C_PAGE("Паж кубков", 11, 11, "Чаши", "пК", "Вода", "Ф", "39.gif"),
    C_KNIGHT("Рыцарь кубков", 12, 12, "Чаши", "рК", "Вода", "Ф", "38.gif"),
    C_QUEEN("Дама кубков", 13, 13, "Чаши", "дК", "Вода", "Ф", "37.gif"),
    C_KING("Король кубков", 14, 14, "Чаши", "кК", "Вода", "Ф", "36.gif");

    private String displayName;
    private int number;
    private int summedNum;
    private String suit;
    private String shortTitle;
    private String element;
    private String weight; //фигура
    private String link;

    @Override
    public String toString() {
        return name();
    }
}
